In [1]:
import numpy as np

In [2]:
#Find common elements in a list
prices_monday = [10, 30, 50, 60, 90]
prices_tuesday = [50, 20, 80, 125, 10, 70]

a=np.array(prices_monday)
b=np.array(prices_tuesday)
print(np.intersect1d(a,b))

[10 50]

In [5]:
#Find BMI of patience
weights = [57, 69, 54, 65 ,71, 62, 56]
heights = [1.59, 1.75, 1.66, 1.74, 1.64, 1.72, 1.53]
a=np.array(weights)
b=np.array(heights)
print(a/b**2)

[22.54657648 22.53061224 19.59645812 21.46915048 26.39797739 20.9572742
 23.922423  ]

In [13]:
#Adding a element in an array
array1 = [[[3, 4], [8, 2],[5, 9]]]
array1=np.array(array1)
np.insert(array1,obj=3,values=[5, 9], axis= 1)

array([[[3, 4],
        [8, 2],
        [5, 9],
        [5, 9]]])

In [14]:
#Creating eye matrix
identity_5 = np.eye(5)

In [15]:
#Tranposing a matrix
M = [[15, 17, 45, 56], [7, 42, 15, 63], [54, 3, 61, 41], [0, 87, 16, 20]]
np.transpose(M)

array([[15,  7, 54,  0],
       [17, 42,  3, 87],
       [45, 15, 61, 16],
       [56, 63, 41, 20]])

In [19]:
#Write a program to combine the two arrays vertically
A1 = [[5, 9], [7, 6]]
A1 = np.array(A1)
A2 = [[8,-7], [0,4]]
A2=np.array(A2)
print(np.vstack((A1,A2)))

[[ 5  9]
 [ 7  6]
 [ 8 -7]
 [ 0  4]]

In [22]:
#Write a code to combine the two arrays horizontally
A1 = [[-81, 75, 40], [27, 67, 52]]
A1 = np.array(A1)
A2 = [[15, 54], [39, 56]]
A2 = np.array(A2)
print(np.hstack((A1,A2)))

[[-81  75  40  15  54]
 [ 27  67  52  39  56]]

In [25]:
#Write a code to divide the array into three sub-arrays containing equal number of rows
A = [[4, 7], [2, -3], [8, 1], [0, 9], [5,-1], [8, 3]]
A = np.array(A)
np.split(A,3)

[array([[ 4,  7],
        [ 2, -3]]),
 array([[8, 1],
        [0, 9]]),
 array([[ 5, -1],
        [ 8,  3]])]

In [26]:
#Write a program to divide the array into two sub-arrays containing equal number of columns
B = [[8, 7, 0, 9], [2, -3, 5, 10], [8, 5, -1,3]]
B = np.array(B)
np.hsplit(B,2)

[array([[ 8,  7],
        [ 2, -3],
        [ 8,  5]]),
 array([[ 0,  9],
        [ 5, 10],
        [-1,  3]])]

In [28]:
#Write a program to perform one-to-one mapping of the two lists
L1 = [45, 67, 56, 71, 54, 62, 56]
L2 = [21, 52, 64, 10, 49, 74, 26]
#for x,y in zip(L1,L2):
print(list(zip(L1,L2)))

[(45, 21), (67, 52), (56, 64), (71, 10), (54, 49), (62, 74), (56, 26)]

In [31]:
#Define a for loop to apply the function (2x-1)/(x+5) on every element of an array
numbers = [6, 5, 3, 15]
numbers=np.array(numbers)
for x in numbers:
     print((2*x-1)/(x+5))

1.0
0.9
0.625
1.45

# Day 2

In [33]:
import pandas as pd

In [39]:
#Write a program to create a dataframe from list of lists
data = [['Joy', 21], ['Mia', 15], ['Sam', 14]]
a=pd.DataFrame(data,columns=['Name','Age'])

b=pd.DataFrame({'Name':['Ashwin','Vasu'],'Age':[25,22]})
b

     Name  Age
0  Ashwin   25
1    Vasu   22

In [38]:
#Extract the second word from the given string
sentence = 'Be confident and be yourself'
sentence.split(' ')[1]

'confident'

In [53]:
#Select the rows from below dataframe where marks are less than 60
df_student = pd.DataFrame({'Name': ['John', 'Robert', 'Jonny', 'Mia'],
                           'Marks': [90, 50, 89, 55]})
df_student[df_student['Marks']<60]

     Name  Marks
1  Robert     50
3     Mia     55

In [70]:
#Write a program to select the rows where the sales are higher than 60000 for Mumbai
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune', 'Mumbai', 'Pune'],
                         'Sales': [40000, 45000, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})

df_store[(df_store['Sales']>60000) & (df_store['Location']=='Mumbai')]

  Store Location  Sales
3     C   Mumbai  90000
8     C   Mumbai  89000

In [67]:
#Write a program to select stores located in Hyderabad
df_store[df_store['Store']=='Hyderabad']['Store']

Series([], Name: Store, dtype: object)

In [71]:
#map() function to replace 'A', 'B', 'C', and 'D' with 'Store_A', Store_B', 'Store_C' and 'Store_D' respectively
df_store['Store']=df_store['Store'].map({'A':'Store_A','B':'Store_B','C':'Store_C','D':'Store_D'})
df_store

     Store   Location  Sales
0  Store_A     Mumbai  40000
1  Store_B       Pune  45000
2  Store_A  Hyderabad  56000
3  Store_C     Mumbai  90000
4  Store_D       Pune  89000
5  Store_A      Delhi  87000
6  Store_D  Hyderabad  85000
7  Store_A       Pune  78000
8  Store_C     Mumbai  89000
9  Store_B       Pune  70000

In [74]:
city = ['Delhi', 'Mumbai', 'Chennai', 'Kolkata']
a=pd.DataFrame(city)
a

         0
0    Delhi
1   Mumbai
2  Chennai
3  Kolkata

In [79]:
#Find the maximum sales for each store
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'HyderabadFind the maximum sales for each store', 'Pune', 'Mumbai', 'Pune'],
                         'Sales': [40000, 45000, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})

df_store.groupby('Store').max()

      Location  Sales
Store
A         Pune  87000
B         Pune  70000
C       Mumbai  90000
D         Pune  89000

In [82]:
df_store.iloc[:,df_store.columns!='Location']

  Store  Sales
0     A  40000
1     B  45000
2     A  56000
3     C  90000
4     D  89000
5     A  87000
6     D  85000
7     A  78000
8     C  89000
9     B  70000

In [90]:
data = {'Name': ['Emma Larter', 'Mia Junior', 'Sophia Depp', 'James Smith'], 'Age': [34, 59, 32, 40]}
df_student = pd.DataFrame(data=data)
value = [35000, 24000, 55000, 40000]
df_student.insert(loc=1,value=value,column='Salary')
df_student

          Name  Salary  Age
0  Emma Larter   35000   34
1   Mia Junior   24000   59
2  Sophia Depp   55000   32
3  James Smith   40000   40

In [92]:
#Write a program to count total sales per store
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
                         'Mumbai', 'Pune'],
                         'Sales': [40000, 45000, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
df_store.groupby('Store').sum()

        Sales
Store
A      261000
B      115000
C      179000
D      174000

In [96]:
#Write a program to sort the dataframe by 'Sales' in ascending order
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
                         'Mumbai', 'Pune'],
                         'Sales': [40000, 45000, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})
df_store.sort_values(by=['Sales'],ascending=True)

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45000
2     A  Hyderabad  56000
9     B       Pune  70000
7     A       Pune  78000
6     D  Hyderabad  85000
5     A      Delhi  87000
4     D       Pune  89000
8     C     Mumbai  89000
3     C     Mumbai  90000

In [97]:
#Write a program to sort the dataframe by 'Store' in ascending order and by 'Sales' in descending order simultaneously
df_store.sort_values(by=['Store','Sales'],ascending=[True,False])

  Store   Location  Sales
5     A      Delhi  87000
7     A       Pune  78000
2     A  Hyderabad  56000
0     A     Mumbai  40000
9     B       Pune  70000
1     B       Pune  45000
3     C     Mumbai  90000
8     C     Mumbai  89000
4     D       Pune  89000
6     D  Hyderabad  85000

In [99]:
#Create a column 'Rank_sales' which contains the rank of each store based on sales of the product in ascending order
df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
                         'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
                         'Mumbai', 'Pune'],
                         'Sales': [40000, 45000, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]})

# print the data
df_store

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45000
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

In [103]:
df_store['Ranked_sales']=df_store['Sales'].rank(ascending=True)
df_store

  Store   Location  Sales  Ranked_sales
0     A     Mumbai  40000           1.0
1     B       Pune  45000           2.0
2     A  Hyderabad  56000           3.0
3     C     Mumbai  90000          10.0
4     D       Pune  89000           8.5
5     A      Delhi  87000           7.0
6     D  Hyderabad  85000           6.0
7     A       Pune  78000           5.0
8     C     Mumbai  89000           8.5
9     B       Pune  70000           4.0

In [106]:
#Rank the dataframe in descending order of sales by each store
df_store['Ranked_sales']=df_store['Sales'].rank(ascending=False)
df_store

  Store   Location  Sales  Ranked_sales
0     A     Mumbai  40000          10.0
1     B       Pune  45000           9.0
2     A  Hyderabad  56000           8.0
3     C     Mumbai  90000           1.0
4     D       Pune  89000           2.5
5     A      Delhi  87000           4.0
6     D  Hyderabad  85000           5.0
7     A       Pune  78000           6.0
8     C     Mumbai  89000           2.5
9     B       Pune  70000           7.0